app/controllers/articles_controller.rb

SELECT * FROM "articles"
---
  def index
    if logged_in?
      @articles = Article.all